АлогистикТест2/src/Documents/алк_ГрафикРаботыУчастка/алк_ГрафикРаботыУчастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ГрафикРаботыУчастка</name>
  <registerRecords>InformationRegister.алк_ГрафикСмен</registerRecords>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРабочееВремя</name>
    <type>
      <types>CatalogRef.алк_Простой</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонППР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонППР_ночь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цех</name>
    <comment>денормализация - для ускорения работы, чтоб не брать из участка, т.к. тормозит РЛС</comment>
    <type>
      <types>CatalogRef.алк_Цеха</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяРаботы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СменаУдалить</name>
      <type>
        <types>EnumRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ППР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ППР_ночь</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.алк_Смены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СменаУдалить</name>
      <type>
        <types>EnumRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПростоя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участок</name>
      <type>
        <types>CatalogRef.алк_Участки</types>
      </type>
    </attributes>
    <attributes>
      <name>Узел</name>
      <type>
        <types>CatalogRef.алк_УзелУчастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Простой</name>
      <type>
        <types>CatalogRef.алк_Простой</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПростоя</name>
      <type>
        <types>CatalogRef.алк_ВидПростоя</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПростоя</name>
      <type>
        <types>CatalogRef.алк_ТипПростоя</types>
      </type>
    </attributes>
    <attributes>
      <name>Служба</name>
      <type>
        <types>CatalogRef.алк_Службы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.алк_Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>МашинныйЦентр</name>
      <type>
        <types>CatalogRef.алк_МашинныйЦентр</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>CatalogRef.алк_АналитикаПростоя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ГрафикСмен/алк_ГрафикСмен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ГрафикСмен</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_ГрафикРаботыУчастка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Цех) Тогда 		
		Цех = Участок.Цех;             	
	КонецЕсли;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	// требуется проверить наличие уже проведенных документов данном периоде
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ГрафикРаботыУчастка.Ссылка
		|ИЗ
		|	Документ.алк_ГрафикРаботыУчастка КАК алк_ГрафикРаботыУчастка
		|ГДЕ
		|	алк_ГрафикРаботыУчастка.Проведен
		|	И алк_ГрафикРаботыУчастка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И алк_ГрафикРаботыУчастка.Ссылка <> &Ссылка
		|	И алк_ГрафикРаботыУчастка.Участок = &Участок";
	
	Запрос.УстановитьПараметр("Дата1", 		НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2", 		КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("Участок", 	Участок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщить("Может быть только один заполненный график работы участка в месяц!");  	
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Требуется отменить проведение документа: " + ВыборкаДетальныеЗаписи.Ссылка);		
		Отказ = Истина;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		// регистр алк_ГрафикСмен
		Движения.алк_ГрафикСмен.Записывать = Истина;
		Для Каждого ТекСтрокаВремяРаботы Из ВремяРаботы Цикл
			Движение = Движения.алк_ГрафикСмен.Добавить();
			Движение.ДатаСмены =  ТекСтрокаВремяРаботы.Дата;
			Движение.Смена = ТекСтрокаВремяРаботы.Смена;
			Движение.Участок = Участок;
			Движение.Бригада = Справочники.Бригады.НайтиПоНаименованию(ТекСтрокаВремяРаботы.Бригада);
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)	
	
	ТабличнаяЧасть.Очистить();  
		
	Для каждого Стр Из ВремяРаботы Цикл 		
		Стр.ППР = Ложь;
		Стр.ППР_ночь = Ложь;	
	КонецЦикла;
		
КонецПроцедуры
